Repository: darktable-org/darktable
Catalog: doc/usermanual/po/cs.tmx
Source language: en
Languages: cs

source: Virtual Lighttable and Darkroom
cs: Virtuální prosvětlovací pult a fotokomora

source: Organize and develop images from digital cameras
cs: Správa a vyvolávání snímků z digitálních fotoaparátů

source: graphics;photography;raw;
cs: grafika;fotografie;raw;

source: GUI options
cs: volby GUI

source: import
cs: importovat

source: ignore JPEG images when importing film rolls
cs: ignorovat snímky JPEG během importu filmových rolí

source: double click to reset to `%s'
cs: dvojitým kliknutím obnovíte "%s"

source: FALSE
cs: NE

source: when having raw+JPEG images together in one directory it makes no sense to import both. with this flag one can ignore all JPEGs found.
cs: v situaci, kdy jsou v jednom adresáři snímky raw i JPEG, nemá smysl importovat oba dva. tímto lze ignorovat všechny nalezené snímky JPEG.

source: recursive directory traversal when importing filmrolls
cs: během importu rolí filmu číst i podadresáře

source: creator to be applied when importing
cs: autor, který má být přidán během importu

source: publisher to be applied when importing
cs: vydavatel, který má být přidán během importu

source: rights to be applied when importing
cs: práva, která mají být přidána během importu

source: comma separated tags to be applied when importing
cs: čárkou oddělené štítky, které mají být přidány během importu

source: initial import rating
cs: výchozí hodnocení při importu

source: double click to reset to `%d'
cs: dvojitým kliknutím obnovíte "%d"

source: initial star rating for all images when importing a filmroll
cs: výchozí hodnocení všech při načítání rolí filmu

source: lighttable
cs: prosvětlovací pult

source: don't use embedded preview JPEG but half-size raw
cs: nepoužívat vložený náhled JPEG, ale vygenerovat poloviční raw

source: check this option to not use the embedded JPEG from the raw file but process the raw data. this is slower but gives you color managed thumbnails.
cs: zaškrtněte tuto volbu pro použití raw dat místo vloženého JPEGu. pomalejší, ale umožní náhledy se správou barev ICC.

source: high quality thumb processing from size
cs: náhledy ve vysoké kvalitě od velikosti

source: always
cs: vždy

source: small
cs: malý

source: never
cs: nikdy

source: if the thumbnail size is greater than this value, it will be processed using the full quality rendering path (better but slower).
cs: pokud je velikost náhledu větší než tato hodnota, bude vytvořen v plné kvalitě renderovací cesty (lepší, ale pomalejší)

source: enable extended thumb overlay
cs: aktivovat rozšířené info k náhledům

source: if set to true, thumb overlay shows filename and some exif data.
cs: pokud aktivováno, u náhledů se zobrazí název souboru a některé údaje z exif.

source: use single-click in the collect panel
cs: použít jednoduché kliknutí v panelu "posbírat snímky"

source: check this option to use single-click to select items in the collect panel. this will allow you to do range selections for date-time and numeric values.
cs: zaškrtněte pro výběr položek v panelu "posbírat snímky" jednoduchým kliknutím, čímž - pro hodnoty data, času a čísel - bude možné posbírat snímky v rozsahu hodnot.

source: expand a single lighttable module at a time
cs: rozbalit pouze jeden modul v režimu prosvětlovacího pultu

source: this option toggles the behavior of shift clicking in lighttable mode
cs: tato volba přepíná chování kliknutí s shiftem v režimu prosvětlovacího pultu

source: scroll to lighttable modules when expanded/collapsed
cs: při rozbalení/sbalení se posunout k modulům prosvětlovacího pultu

source: when this option is enabled then darktable will try to scroll the module to the top of the visible list
cs: když bude tato volba aktivní, tak se darktable pokusí posunout modul do horní části viditelného seznamu

source: rating an image one star twice will not zero out the rating
cs: opakované kliknutí na jednu hvězdičku zruší hodnocení snímku

source: do not have the rating of one star behave as documented in the manual--an image rated one star twice will result in a zero star rating.
cs: nepoužít chování opakovaného kliknutí na jednu hvězdičku dle manuálu (dvojí kliknutí na hvězdičku zruší hodnocení).

source: darkroom
cs: fotokomora

source: pen pressure control for brush masks
cs: ovládání tlaku pera pro štětcové masky

source: off
cs: vypnuto

source: hardness (relative)
cs: tvrdost (relativní)

source: hardness (absolute)
cs: tvrdost (absolutní)

source: opacity (relative)
cs: krytí (relativní)

source: opacity (absolute)
cs: krytí (absolutní)

source: brush size (relative)
cs: velikost štětce (relativní)

source: off - pressure reading ignored, hardness/opacity/brush size - pressure reading controls specified attribute, absolute/relative - pressure reading is taken directly as attribute value or multiplied with pre-defined setting.
cs: vypnuto - přítlak pera je ignorován, tvrdost/krytí/velikost štětce - přítlak pera ovlivňuje určený atribut, absolutní/relativní - přítlak pera je použit jako hodnota atributu nebo násoben předvolenou hodnotou.

source: smoothing of brush strokes
cs: vyhlazování tahů štěcem

source: low
cs: nízký

source: medium
cs: středně

source: high
cs: vysoký

source: sets level for smoothing of brush strokes. stronger smoothing leads to less nodes and easier editing but with lower control of accuracy.
cs: nastaví úroveň pro vyhlazování tahů štětcem. silnější vyhlazování vede k méně uzlům a snadnějšímu editování, ale s menší přesností.

source: display of individual color channels
cs: zobrazení jednotlivých kanálů barev

source: false color
cs: neplatná barva

source: grey scale
cs: šedá stupnice

source: defines how color channels are displayed when activated in the parametric masks feature.
cs: určuje způsob zobrazení kanálů barev při aktivaci parametrické masky.

source: pattern for the image infos line
cs: vzor pro řádek s informacemi o snímku

source: see manual to know all the tags you can use.
cs: pro zjištění všech možných štítků viz manuál

source: position of the image infos line
cs: umístění řádku s informacemi o snímku

source: top left
cs: vlevo nahoře

source: top right
cs: vpravo nahoře

source: top center
cs: střed nahoře

source: bottom
cs: spodek

source: hidden
cs: skryté

source: show search module text entry
cs: ukázat textový vstup modulu vyhledávání

source: show search text
cs: ukázat hledaný text

source: show groups
cs: zobrazit skupiny

source: show both
cs: zobrazit oboje

source: expand a single darkroom module at a time
cs: rozbalit pouze jeden modul v režimu fotokomory

source: TRUE
cs: ANO

source: this option toggles the behavior of shift clicking in darkroom mode
cs: tato volba přepíná chování kliknutí s shiftem v režimu fotokomory

source: expand the module when it is activated, and collapse it when disabled
cs: rozbalit modul, je-li aktivován, a sbalit jej při deaktivaci

source: this option allows to expand or collapse automatically the module when it is enabled or disabled.
cs: tato volba umožní automatické rozbalení či sbalení modulu, když je aktivován či deaktivován.

source: scroll to darkroom modules when expanded/collapsed
cs: při rozbalení/sbalení se posunout k modulům fotokomory

source: border around image in darkroom mode
cs: rámeček okolo obrázku v režimu fotokomory

source: process the image in darkroom mode with a small border. set to 0 if you don't want any border.
cs: zobrazit snímek v režimu fotokomory s malým rámečkem. nastavte 0, pokud nechcete žádný rámeček.

source: map / geolocalisation
cs: mapa / geolokalizace

source: only draw images on map that are currently collected and filtered
cs: na mapě zobrazit pouze snímky, které jsou v aktuální sbírce a filtru

source: use the current filter settings to select the geotagged images drawn on the map, i.e. limit the images drawn to the current filmstrip. this limits the number of images drawn and thus reduces the time needed to draw the images.
cs: použít aktuální nastavení filtru pro zobrazení snímků s geolokačními štítky na mapě, tj. omezit zobrazené snímky na aktuální filmový pás. toto omezuje počet zobrazených snímků a tedy zkracuje čas potřebný k jejich vykreslení.

source: maximum number of images drawn on map
cs: maximální počet snímků na mapě

source: the maximum number of geotagged images drawn on the map. increasing this number can slow drawing of the map down.
cs: maximální počet snímků zobrazitelných na mapě (týká se jen snímků s údaji o poloze). zvýšení tohoto čísla může zpomalit vykreslení mapy.

source: pretty print the image location
cs: zobrazit polohu snímku čitelněji

source: show a more readable representation of the location in the image information module
cs: zobrazit údaje o poloze snímku v oblasti informačního modulu čitelnějším způsobem

source: security
cs: zabezpečení

source: ask before removing images from database
cs: vyžadovat potvrzení při odstraňování snímků z databáze

source: always ask the user before any image is removed from DB.
cs: vyžadovat potvrzení při odstraňování snímků z databáze.

source: ask before erasing images from disk / discarding history stack
cs: vyžadovat potvrzení při mazání snímků z disku či odstranění historie

source: always ask the user before any image file is deleted / history stack is discarded.
cs: vždy vyžadovat potvrzení při mazání snímků či odstranění historie.

source: send files to trash when erasing images
cs: při mazání snímků přemístit soubory do koše

source: send files to trash instead of permanently deleting files on system that supports it
cs: na systémech, které podporují přemístění souborů do koše, tak učinit namísto skutečného smazání

source: ask before moving images from film roll folder
cs: vyžadovat potvrzení při přesunu snímků ze složky role filmu

source: always ask the user before any image file is moved.
cs: vyžadovat potvrzení při přesunu snímků.

source: ask before copying images to new film roll folder
cs: vyžadovat potvrzení při kopírování snímků do složky nové role filmu

source: always ask the user before any image file is copied.
cs: vyžadovat potvrzení při kopírování snímků.

source: ask before removing empty folders
cs: vyžadovat potvrzení při odstraňování prázdných složek

source: always ask the user before removing any empty folder. this can happen after moving or deleting images.
cs: vždy vyžadovat potvrzení při mazání prádné složky. může k tomu dojít po přemístění či smazání snímků.

source: ask before deleting a tag
cs: vyžadovat potvrzení při mazání štítku

source: ask before deleting a style
cs: vyžadovat potvrzení při mazání stylu

source: miscellaneous
cs: různé

source: width of the side panels in pixels
cs: šířka postranních panelů v pixelech

source: (needs a restart)
cs: (vyžaduje opětovné spuštění)

source: waiting time between each picture in slideshow
cs: prodleva mezi snímky v prezentaci

source: do not show april 1st game
cs: nezobrazovat hru "apríl"

source: number of folder levels to show in lists
cs: počet úrovní adresářů pro zobrazení v seznamech

source: the number of folder levels to show in film roll names, starting from the right
cs: počet úrovní adresářů, které se mají zobrazit ve jménech rolí filmu (zprava)

source: enable filmstrip
cs: povolit filmový pás

source: enable the filmstrip in darkroom, tethering and map modes.
cs: povolit filmový pás v režimu fotokomory, vzdáleného snímání a mapy.

source: enable timeline
cs: zapnout časovou osu

source: enable the timeline in lighttable mode.
cs: zapnout časovou osu v režimu prosvětlovacího stolku.

source: overlay txt sidecar over zoomed images
cs: zobrazit postranní soubor txt přes přiblížené snímky

source: when there is a txt file next to an image it can be shown as an overlay over zoomed images on the lighttable. the txt file either has to be there at import time or the crawler has to be enabled
cs: pokud vedle souboru se snímkem existuje i soubor txt, může být tento zobrazen přes snímky v přiblíženém pohledu v režimu prosvětlovacího pultu. soubor txt musí existovat již při importu nebo se musí aktivovat crawler

source: mouse wheel scrolls modules side panel by default
cs: ve výchozím nastavení kolečko myši posouvá boční panel s moduly

source: when enabled, use mouse wheel to scroll modules side panel. use ctrl+alt to use mouse wheel for data entry. when disabled, this behavior is reversed
cs: je-li aktivováno, použijte kolečko myši pro posun modulů v postranním panelu. použijte ctrl+alt pro přepnutí kolečka myši pro zadávání dat. je-li neaktivní, chování se obrátí.

source: show scrollbars for center view
cs: zobrazit posuvníky i ve středním okně

source: no scrollbars
cs: bez posuvníků

source: lighttable + darkroom
cs: pult + fotokomora

source: defines where scrollbars should be displayed
cs: určuje, kdy se mají zobrazit extra posuvníky ve středním okně

source: always show panels' scrollbars
cs: vždy zobrazit posuvníky panelů

source: defines whether the panel scrollbars should be always visible or activated only depending on the content. (need a restart)
cs: definuje, zda budou posuvníky viditelné vždy nebo jen v případě potřeby. (vyžaduje opětovné spuštění aplikace.)

source: method to use for getting the display profile
cs: metoda použitá pro získání profilu displeje

source: all
cs: vše

source: this option allows to force a specific means of getting the current display profile. this is useful when one alternative gives wrong results
cs: tato volba umožní vynucení konkrétního způsobu získání profilu pro aktuální displej. toto je vhodné, když ostatní alternativy nefungují dle očekávání

source: core options
cs: základní volby

source: quality
cs: kvalita

source: color manage cached thumbnails
cs: aktivovat správu barev pro náhledy v dočasné paměti

source: if enabled, cached thumbnails will be color managed so that lighttable and filmstrip can show correct colors. otherwise the results may look wrong once the display profile gets changed.
cs: pokud aktivováno, pro náhledy v dočasné paměti se použije správa barev, takže v režimu prosvětlovacího pultu a filmového pásu budou zobrazeny správné barvy. v opačném případě může při změně ICC profilu displeje náhled vypadat chybně.

source: always use LittleCMS 2 to apply output color profile
cs: vždy použít LittleCMS 2 pro použití výstupního profilu barev

source: this is slower than the default.
cs: toto je pomalejší než výchozí nastavení.

source: do high quality processing for slideshow
cs: pro promítání převzorkovat ve vysoké kvalitě

source: same option as for export, but applies to slideshow.
cs: stejná volba jako pro export, ale týká se režimu promítání.

source: demosaicing for zoomed out darkroom mode
cs: metoda demosaicingu pro zmenšený pohled v režimu fotokomory

source: always bilinear (fast)
cs: vždy bilineární (rychlé)

source: at most PPG (reasonable)
cs: většinou PPG (rozumné)

source: full (possibly slow)
cs: plný (dost možná pomalé)

source: interpolation when not viewing 1:1 in darkroom mode: bilinear is fastest, but not as sharp. middle ground is using PPG + interpolation modes specified below, full will use exactly the settings for full-size export. X-Trans sensors use VNG rather than PPG as middle ground.
cs: interpolace použitá při prohlížení mimo 1:1 v režimu fotokomory: bilineární je nejrychlejší, ale ne tak ostrá. střední volba je PPG + níže specifikované interpolační metody, plná použije stejné nastavení jako pro export v plné velikosti (výše).

source: pixel interpolator
cs: metoda interpolace

source: bilinear
cs: bilineární

source: bicubic
cs: bikubická

source: pixel interpolator used in rotation and lens correction (bilinear, bicubic, lanczos2, lanczos3).
cs: interpolace pixelů použita při rotaci a korekci objektivu (bilineární, bikubická, lanczos2, lanczos3).

source: auto-apply basecurve
cs: automaticky použít základní křivku

source: use a basecurve by default (needs a restart)
cs: použít základní křivku ve výchozím nastavení (vyžaduje restart)

source: auto-apply per camera basecurve presets
cs: automaticky použít přednastavené základní křivky dle fotoaparátů

source: use the per-camera basecurve by default instead of the generic manufacturer one if there is one available (needs a restart)
cs: je-li k dispozici, použít základní křivky pro jednotlivé fotoaparáty namísto generické křivky výrobce (vyžaduje opětovné spuštění)

source: auto-apply sharpen
cs: automaticky aplikovat doostření

source: this added sharpen is not recommended on cameras without a low-pass filter. the default is to not add any sharpening automatically as most recent cameras have no low-pass filter. (need a restart)
cs: dodatečné doostření se nedoporučuje pro fotoaparáty bez low pass filtru. většina dnešních fotoaparátů nemá low-pass filtr, výchozí nastavení je proto bez automatického doostření. (vyžaduje restart)

source: write sidecar file for each image
cs: zapsat pro každý snímek postranní soubor xml

source: these redundant files can later be re-imported into a different database, preserving your changes to the image.
cs: tyto soubory mohou být později znovu importovány do jiné databáze, při zachování vašich úprav na snímku.

source: store xmp tags in compressed format
cs: uložit štítky XMP v komprimovaném formátu

source: only large entries
cs: pouze velké záznamy

source: entries in xmp tags can get rather large and may exceed the available space to store the history stack in output files. this option allows xmp tags to be compressed and save space.
cs: záznamy ve štítcích XMP mohou být velmi objemné a mohou překročit prostor dostupný pro historii úprav exportovanou do výstupních souborů. tato volba umožní, aby se štítky XMP komprimovaly a zabíraly méně místa.

source: look for updated xmp files on startup
cs: při spuštění vyhledat aktualizované soubory XMP

source: check file modification times of all xmp files on startup to check if any got updated in the meantime
cs: při spuštění zkontrolovat čas modifikace souborů XMP, aby se zjistily případné aktualizace

source: cpu / gpu / memory
cs: cpu / gpu / paměť

source: memory in megabytes to use for thumbnail cache
cs: paměť v megabajtech použitá pro dočasnou paměť náhledů

source: this controls how much memory is going to be used for thumbnails and other buffers (needs a restart).
cs: toto kontroluje velikost operační paměti pro náhledy a ostatní dočasnou paměť (buffer). (vyžaduje opětovné spuštění.)

source: enable disk backend for thumbnail cache
cs: aktivovat diskový backend pro dočasnou paměť náhledů

source: if enabled, write thumbnails to disk (.cache/darktable/) when evicted from the memory cache. note that this can take a lot of memory (several gigabytes for 20k images) and will never delete cached thumbnails again. it's safe though to delete these manually, if you want. light table performance will be increased greatly when browsing a lot. to generate all thumbnails of your entire collection offline, run 'darktable-generate-cache'.
cs: pokud aktivováno, náhledy se zapíší na disk (.cache/darktable/) v okamžiku vypuzení z dočasné paměti. toto může zabrat hodně místa (několik gigabajtů pro 20 tis. snímků) a tyto dočasné náhledy nebudou nikdy smazány. nicméně pakliže chcete, můžete je smazat ručně. výkon režimu prosvětlovacího pultu se při prohlížení náhledů snímků rapidně zvýší. pro vygenerování všech náhledů vaší kompletní sbírky v off-line režimu spusťte 'darktable-generate-cache'.

source: enable disk backend for full preview cache
cs: zapnout diskový backend pro dočasnou paměť plných náhledů

source: if enabled, write full preview to disk (.cache/darktable/) when evicted from the memory cache. note that this can take a lot of memory (several gigabytes for 20k images) and will never delete cached thumbnails again. it's safe though to delete these manually, if you want. light table performance will be increased greatly when zooming image in full preview mode.
cs: pokud aktivováno, plné náhledy se zapíší na disk (.cache/darktable/) v okamžiku vypuzení z dočasné paměti. toto může zabrat hodně místa (několik gigabajtů pro 20k snímky) a tyto dočasné náhledy nebudou nikdy smazány. nicméně pakliže chcete, můžete je smazat ručně. výkon režimu prosvětlovacího pultu se však při prohlížení plných náhledů snímků velmi zlepší.

source: number of background threads
cs: počet vláken běžících v pozadí

source: this controls for example how many threads are used to create thumbnails during import. the cache will grow to a maximum of twice this number of full resolution image buffers (needs a restart).
cs: toto například udává, kolik vláken bude použito pro vytváření náhledů během importu. vyrovnávací paměť se zvýší na maximálně dvojnásobek tohoto počtu mezipamětí snímků v plném rozlišení. (vyžaduje opětovné spuštění.)

source: host memory limit (in MB) for tiling
cs: limit pro pamět (v MB) pro segmentování

source: this variable controls the maximum amount of memory (in MB) a module may use during image processing. lower values will force memory hungry modules to process image with increasing number of tiles. setting this to 0 will omit any limit. values below 500 will be treated as 500 (needs a restart).
cs: tato proměnná nastavuje maximální velikost paměti (v MB), která může být použita modulem při zpracování snímku. nižší hodnoty donutí paměťově náročné moduly k rozdělení snímků na vyšší počet segmentů během zpracování. nastavení na nulu znamená bez omezení paměti. hodnoty nižší než 500 budou chápány jako 500. (vyžaduje opětovné spuštění.)

source: minimum amount of memory (in MB) for a single buffer in tiling
cs: minimální velikost paměti (v MB) pro jednu mezipaměť během segmentování

source: if set to a positive, non-zero value this variable defines the minimum amount of memory (in MB) that tiling should take for a single image buffer. has precedence over heuristics based on host_memory_limit (needs a restart).
cs: pokud je uvedeno kladné nenulové číslo, pak tato proměnná definuje minimální velikost paměti (v MB), která má být zabrána jednou mezipamětí při segmentování. má přednost před heuristikou založenou na položce "limit pro paměť". (vyžaduje opětovné spuštění.)

source: activate OpenCL support
cs: aktivovat podporu OpenCL

source: if found, use OpenCL runtime on your system for improved processing speed. can be switched on and off at any time.
cs: pokud je nalezena, použije se pro zrychlení zpracování knihovna OpenCL. může být kdykoliv zapnuto či vypnuto.

source: not available
cs: není dostupné

source: not available on this system
cs: na tomto systému není k dispozici

source: OpenCL scheduling profile
cs: profil plánování OpenCL

source: default
cs: výchozí

source: multiple GPUs
cs: více jednotek GPU

source: very fast GPU
cs: velmi rychlá GPU

source: defines how preview and full pixelpipe tasks are scheduled on OpenCL enabled systems. default - GPU processes full and CPU processes preview pipe (adaptable by config parameters); multiple GPUs - process both pixelpipes in parallel on two different GPUs; very fast GPU - process both pixelpipes sequentially on the GPU.
cs: u systémů podporujících OpenCL určuje, jak budou plánovány úlohy pro náhledy a finální zobrazení. výchozí - GPU zpracovává finální zobrazení a CPU zpracovává náhledy (přizpůsobitelné pomocí konfiguračních parametrů); vícejednotkové GPU - zpracovat jak finální zobrazení tak i náhledy na dvou odlišných jednotkách GPU; velmi rychlá GPU - zpracovat obojí sekvenčně pomocí GPU.

source: omit hierarchy in simple tag lists
cs: vynechat hiearchii v jednoduchém seznamu štítků
